/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncmp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tkeneshb <tkeneshb@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/31 14:10:44 by tkeneshb          #+#    #+#             */
/*   Updated: 2023/04/06 20:17:25 by tkeneshb         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_strncmp(const char *s1, const char *s2, size_t n)
{
	unsigned char	c1;
	unsigned char	c2;

	while (n--)
	{
		c1 = (unsigned char)*s1++;
		c2 = (unsigned char)*s2++;
		if (c1 != c2)
			return (c1 - c2);
		if (!c1)
			break ;
	}
	return (0);
}

// Функция проходит по символам обеих строк, сравнивая их по очереди
// до тех пор, пока не встретит символ конца строки '\0',
// или пока не будет сравнено n символов. Если какие-то символы отличаются,
// функция возвращает разницу между значениями символов.
// Если же все символы совпадают, функция возвращает 0.