/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlcpy.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tkeneshb <tkeneshb@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/03/29 14:06:34 by tkeneshb          #+#    #+#             */
/*   Updated: 2023/03/31 14:02:35 by tkeneshb         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

size_t	ft_strlcpy(char *dst, const char *src, size_t dstsize)
{
	size_t	len;

	len = 0;
	while (src[len] && len + 1 < dstsize)
	{
		dst[len] = src[len];
		len++;
	}
	if (dstsize > 0)
		dst[len] = '\0';
	while (src[len])
		len++;
	return (len);
}

// Функция начинает копирование символов из строки src в строку dst,
// пока не встретит символ конца строки '\0' или
// не заполнит весь буфер dst размера dstsize - 1.
// После копирования функция добавляет в конец строки dst нулевой символ.